Resources/canonical_library/wsdl/Terminate.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:p1="http://test.sap.com/ZUDI" xmlns:p2="https://services.ird.govt.nz/GWS/Employment/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" name="Terminate" soap:location="http://www.example.org/" targetNamespace="http://test.sap.com/ZUDI" wsdlsoap:location="http://www.example.org/"><wsdl:documentation/><wsp:UsingPolicy wsdl:required="true"/><wsp:Policy wsu:Id="OP_Terminate"/><wsdl:types><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/:types/TerminateResponse" xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/:types/TerminateResponse"><xsd:import namespace="urn:www.ird.govt.nz/GWS:types/Employment"/><xsd:complexType name="TerminateResponseType"><xsd:sequence><xsd:element form="qualified" name="TerminateResponseWrapper" nillable="true"><xsd:complexType><xsd:sequence><xsd:element ref="emp:employmentResponse"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/" xmlns:q3="https://services.ird.govt.nz/GWS/Employment/:types/TerminateRequest" xmlns:q4="https://services.ird.govt.nz/GWS/Employment/:types/TerminateResponse" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/"><xsd:import namespace="https://services.ird.govt.nz/GWS/Employment/:types/TerminateResponse"/><xsd:import namespace="https://services.ird.govt.nz/GWS/Employment/:types/TerminateRequest"/><xsd:element name="TerminateResponse"><xsd:complexType><xsd:sequence><xsd:element form="qualified" minOccurs="0" name="TerminateResult" nillable="true" type="q4:TerminateResponseType"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="Terminate"><xsd:complexType><xsd:sequence><xsd:element form="qualified" name="TerminateRequestMsg" nillable="true" type="q3:TerminateRequestType"/></xsd:sequence></xsd:complexType></xsd:element></xsd:schema><xsd:schema xmlns="https://services.ird.govt.nz/GWS/Employment/:types/TerminateRequest" xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="https://services.ird.govt.nz/GWS/Employment/:types/TerminateRequest"><xsd:import namespace="urn:www.ird.govt.nz/GWS:types/Employment"/><xsd:complexType name="TerminateRequestType"><xsd:sequence><xsd:element form="qualified" name="TerminateRequestWrapper" nillable="true"><xsd:complexType><xsd:sequence><xsd:element ref="emp:terminateRequest"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="p2.Employment_Terminate_InputMessage"><wsdl:documentation/><wsdl:part element="p2:Terminate" name="parameters"/></wsdl:message><wsdl:message name="p2.Employment_Terminate_OutputMessage"><wsdl:documentation/><wsdl:part element="p2:TerminateResponse" name="parameters"/></wsdl:message><wsdl:portType name="Terminate"><wsdl:documentation/><wsdl:operation name="Terminate"><wsdl:documentation/><wsp:Policy><wsp:PolicyReference URI="#OP_Terminate"/></wsp:Policy><wsdl:input message="p1:p2.Employment_Terminate_InputMessage"/><wsdl:output message="p1:p2.Employment_Terminate_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="TerminateBinding" type="p1:Terminate"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Terminate"><soap:operation soapAction="http://sap.com/xi/WebService/soap1.1"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Terminate"><wsdl:port binding="p1:TerminateBinding" name="Terminate"><soap:address location="http://www.example.org/"/></wsdl:port></wsdl:service></wsdl:definitions>