Service - Payday Filing/Employee Details/sample messages/body-employment-terminate-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:emp="https://services.ird.govt.nz/GWS/Employment/"
               xmlns:ter="https://services.ird.govt.nz/GWS/Employment/:types/TerminateRequest"
               xmlns:emp1="urn:www.ird.govt.nz/GWS:types/Employment"
               xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>https://services.ird.govt.nz/GWS/Employment/Employment/Terminate</wsa:Action>
    </soap:Header>
    <soap:Body>
        <emp:Terminate>
            <emp:TerminateRequestMsg>
                <ter:TerminateRequestWrapper>
                    <emp1:terminateRequest>
                        <emp1:header>
                            <com:softwareProviderData>
                                <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                                <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                                <com:softwareRelease>1.0</com:softwareRelease>
                            </com:softwareProviderData>
                            <com:identifier IdentifierValueType="ACCIRD">123456789</com:identifier>
                            <com:accountType>PSO</com:accountType>
                        </emp1:header>
                        <emp1:employeeIdentifier>
                            <emp1:employeeIRD>123456789</emp1:employeeIRD>
                            <emp1:employeeNameOnEILine>MyNameIsEmployee</emp1:employeeNameOnEILine>
                            <!--Optional:-->
                            <emp1:employeeDateOfBirth>1990-07-28</emp1:employeeDateOfBirth>
                            <!--Optional:-->
                            <emp1:employmentStartDate>2015-07-31</emp1:employmentStartDate>
                        </emp1:employeeIdentifier>
                        <emp1:terminateBody>
                            <emp1:employmentFinishDate>2017-07-31</emp1:employmentFinishDate>
                        </emp1:terminateBody>
                    </emp1:terminateRequest>
                </ter:TerminateRequestWrapper>
            </emp:TerminateRequestMsg>
        </emp:Terminate>
    </soap:Body>
</soap:Envelope>