Service - Employment/samples/TerminateRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:empl="https://services.ird.govt.nz/GWS/Employment/" xmlns:ter="https://services.ird.govt.nz/GWS/Employment/:types/TerminateRequest">
   <soap:Header>
      <a:To>http://localhost/WebServices/Gateway/GWS/Employment</a:To>
      <a:Action>https://services.ird.govt.nz/GWS/Employment/Employment/Terminate</a:Action>
   </soap:Header>
   <soap:Body>
      <empl:Terminate>
         <empl:TerminateRequestMsg>
            <ter:TerminateRequestWrapper>
               <!--You may enter ANY elements at this point-->
               <emp:terminateRequest xmlns:emp="urn:www.ird.govt.nz/GWS:types/Employment" xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v1">
                  <emp:header>
                     <cmn:softwareProviderData>
                        <cmn:softwareProvider>Provider</cmn:softwareProvider>
                        <cmn:softwarePlatform>Platform</cmn:softwarePlatform>
                        <cmn:softwareRelease>Release</cmn:softwareRelease>
                     </cmn:softwareProviderData>
                     <cmn:identifier IdentifierValueType="ACCIRD">123009916</cmn:identifier>
                  </emp:header>
                  <emp:employeeIdentifier>
                     <emp:employeeIRD>951753820</emp:employeeIRD>
                     <emp:employeeNameOnEILine>MCharlesPatrickJames</emp:employeeNameOnEILine>
                     <emp:employeeDateOfBirth>1986-07-21</emp:employeeDateOfBirth>
                     <emp:employmentStartDate>2017-03-22</emp:employmentStartDate>
                  </emp:employeeIdentifier>
                  <emp:terminateBody>
                     <emp:employmentFinishDate>2017-09-05</emp:employmentFinishDate>
                  </emp:terminateBody>
               </emp:terminateRequest>
            </ter:TerminateRequestWrapper>
         </empl:TerminateRequestMsg>
      </empl:Terminate>
   </soap:Body>
</soap:Envelope>

